In [3]:
>>> import pandas as pd
>>> import numpy as np

In [14]:
df.head()

   Year Built        lat         lng
0        1978  61.218589 -149.905661
1        1978  61.218589 -149.905661
2        1978  61.218589 -149.905661
3        1978  61.218589 -149.905661
4        1978  61.218589 -149.905661

In [16]:
#remove all properties built after 1925

df = df.drop(df.index[df['Year Built'] > 1925])

In [17]:
df.head()

      Year Built        lat         lng
371         1916  61.213294 -149.912066
778         1913  61.212636 -149.909514
809         1923  61.207862 -149.899426
907         1916  61.208399 -149.904837
2905        1915  61.227668 -149.885540

In [18]:
#save as layer

df.to_csv('anch1925.csv')

In [19]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  index  Year Built        lat         lng
0           0      0        1978  61.218589 -149.905661
1           1      1        1978  61.218589 -149.905661
2           2      2        1978  61.218589 -149.905661
3           3      3        1978  61.218589 -149.905661
4           4      4        1978  61.218589 -149.905661

In [22]:
#remove all homes built before 1926 and after 1940

df = df.drop(df.index[df['Year Built'] > 1940])

df = df.drop(df.index[df['Year Built'] < 1925])

df.head()

     Unnamed: 0  index  Year Built        lat         lng
18           18     18        1930  61.215304 -149.909986
166         166    166        1937  61.214692 -149.906538
167         167    167        1931  61.215044 -149.905948
250         250    250        1935  61.214889 -149.905611
253         253    253        1939  61.215178 -149.905612

In [23]:
# save as layer
df.to_csv('anch26-40.csv')

In [24]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  index  Year Built        lat         lng
0           0      0        1978  61.218589 -149.905661
1           1      1        1978  61.218589 -149.905661
2           2      2        1978  61.218589 -149.905661
3           3      3        1978  61.218589 -149.905661
4           4      4        1978  61.218589 -149.905661

In [25]:
>>> to_drop = ['Unnamed: 0', 'index']

>>> df.drop(to_drop, inplace=True, axis=1)

In [28]:
#remove all homes built before 1940 and after 1960

df = df.drop(df.index[df['Year Built'] < 1941])

df = df.drop(df.index[df['Year Built'] > 1960])

In [ ]:
#save as layer

>>> df = pd.read_csv('resi-cleaned.csv')

In [33]:
#remove all home built before 1960 and 1969

df = df.drop(df.index[df['Year Built'] < 1961])

df = df.drop(df.index[df['Year Built'] > 1969])

In [35]:
#save as layer, repeat with remaining desired layers
df.to_csv('anch61-69.csv')

In [36]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  Year Built        lat         lng
0           0        1978  61.218589 -149.905661
1           1        1978  61.218589 -149.905661
2           2        1978  61.218589 -149.905661
3           3        1978  61.218589 -149.905661
4           4        1978  61.218589 -149.905661

In [37]:
>>> to_drop = ['Unnamed: 0']

>>> df.drop(to_drop, inplace=True, axis=1)

In [38]:
df = df.drop(df.index[df['Year Built'] < 1970])

In [39]:
df = df.drop(df.index[df['Year Built'] > 1979])

In [40]:
df.to_csv('anch71-79.csv')

In [41]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  Year Built        lat         lng
0           0        1978  61.218589 -149.905661
1           1        1978  61.218589 -149.905661
2           2        1978  61.218589 -149.905661
3           3        1978  61.218589 -149.905661
4           4        1978  61.218589 -149.905661

In [42]:
>>> to_drop = ['Unnamed: 0']

>>> df.drop(to_drop, inplace=True, axis=1)

In [43]:
df = df.drop(df.index[df['Year Built'] < 1980])

In [44]:
df = df.drop(df.index[df['Year Built'] > 1989])

In [45]:
df.to_csv('anch80-89.csv')

In [46]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  Year Built        lat         lng
0           0        1978  61.218589 -149.905661
1           1        1978  61.218589 -149.905661
2           2        1978  61.218589 -149.905661
3           3        1978  61.218589 -149.905661
4           4        1978  61.218589 -149.905661

In [47]:
>>> to_drop = ['Unnamed: 0']

>>> df.drop(to_drop, inplace=True, axis=1)

In [48]:
df = df.drop(df.index[df['Year Built'] < 1990])

In [49]:
df = df.drop(df.index[df['Year Built'] > 1999])

In [50]:
df.to_csv('anch90-99.csv')

In [51]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  Year Built        lat         lng
0           0        1978  61.218589 -149.905661
1           1        1978  61.218589 -149.905661
2           2        1978  61.218589 -149.905661
3           3        1978  61.218589 -149.905661
4           4        1978  61.218589 -149.905661

In [52]:
>>> to_drop = ['Unnamed: 0']

>>> df.drop(to_drop, inplace=True, axis=1)

In [53]:
df = df.drop(df.index[df['Year Built'] < 2000])

In [54]:
df = df.drop(df.index[df['Year Built'] > 2008])

In [55]:
df.to_csv('anch2000-08.csv')

In [56]:
>>> df = pd.read_csv('resi-cleaned.csv')
>>> df.head()

   Unnamed: 0  Year Built        lat         lng
0           0        1978  61.218589 -149.905661
1           1        1978  61.218589 -149.905661
2           2        1978  61.218589 -149.905661
3           3        1978  61.218589 -149.905661
4           4        1978  61.218589 -149.905661

In [57]:
>>> to_drop = ['Unnamed: 0']

>>> df.drop(to_drop, inplace=True, axis=1)

In [58]:
df = df.drop(df.index[df['Year Built'] < 2009])

In [59]:
df.to_csv('anch2009-19.csv')